"""
Bar chart demo with pairs of bars grouped for easy comparison.
"""
import numpy as np
import matplotlib.pyplot as plt

real = [
    (u'p',0.092,0.112,0.102,0.01),
    (u'b',0.052,0.067,0.0595,0.0075),
    (u't',0.2,0.226,0.213,0.013),
    (u'd',0.097,0.117,0.107,0.01),
    (u'k',0.134,0.156,0.145,0.011),
    (u'g',0.027,0.039,0.033,0.006),
    (u'f',0.052,0.067,0.0595,0.0075),
    (u'v',0.034,0.045,0.0395,0.0055),
    (u'θ',0.011,0.02,0.0155,0.0045),
    (u'ð',0.005,0.011,0.008,0.003),
    (u's',0.171,0.197,0.184,0.013),
    (u'z',0.024,0.035,0.0295,0.0055),
    (u'ʃ',0.034,0.045,0.0395,0.0055),
    (u'ʒ',0.001,0.004,0.0025,0.0015),
    (u'ʧ',0.017,0.027,0.022,0.005),
    (u'ʤ',0.019,0.029,0.024,0.005),
    (u'm',0.08,0.097,0.0885,0.0085),
    (u'n',0.175,0.198,0.1865,0.0115),
    (u'l',0.144,0.166,0.155,0.011),
    (u'r',0.125,0.146,0.1355,0.0105),
    (u'w',0.029,0.041,0.035,0.006),
    (u'j',0.017,0.026,0.0215,0.0045),
    (u'h',0.019,0.029,0.024,0.005),
    (u'ŋ',0.022,0.032,0.027,0.005),
    (u'ɫ',0.006,0.011,0.0085,0.0025)
]
carroll_lear = [
    (u'p',0.053,0.183,0.118,0.065),
    (u'b',0.114,0.241,0.1775,0.0635),
    (u't',0.044,0.163,0.1035,0.0595),
    (u'd',0.03,0.143,0.0865,0.0565),
    (u'k',0.062,0.184,0.123,0.061),
    (u'g',0.028,0.132,0.08,0.052),
    (u'f',0.077,0.206,0.1415,0.0645),
    (u'v',-0.013,0.053,0.02,0.033),
    (u'θ',-0.017,0.04,0.0115,0.0285),
    (u'ð',-0.009,0.02,0.0055,0.0145),
    (u's',0.09,0.236,0.163,0.073),
    (u'z',0.01,0.097,0.0535,0.0435),
    (u'ʃ',-0.002,0.053,0.0255,0.0275),
    (u'ʒ',0.0,0.0,0.0,0.0),
    (u'ʧ',-0.005,0.068,0.0315,0.0365),
    (u'ʤ',0.004,0.088,0.046,0.042),
    (u'm',0.082,0.264,0.173,0.091),
    (u'n',0.04,0.162,0.101,0.061),
    (u'l',0.107,0.227,0.167,0.06),
    (u'r',0.03,0.131,0.0805,0.0505),
    (u'w',0.008,0.083,0.0455,0.0375),
    (u'j',-0.005,0.017,0.006,0.011),
    (u'h',-0.008,0.024,0.008,0.016),
    (u'ŋ',0.008,0.084,0.046,0.038),
    (u'ɫ',0.058,0.163,0.1105,0.0525)
]

def my_lines():
    unzipped_real = list(zip(*real))
    real_data = unzipped_real[3]
    real_errors = unzipped_real[4]
    plt.errorbar(range(len(real_data)),
                 real_data,
                 yerr=real_errors,
                 capsize=1,
                 fmt='k')

    unzipped_carroll_lear = list(zip(*carroll_lear))
    carroll_lear_data = unzipped_carroll_lear[3]
    carroll_lear_errors = unzipped_carroll_lear[4]
    consonants = unzipped_carroll_lear[0]
    plt.errorbar(range(len(carroll_lear_data)),
                 carroll_lear_data,
                 yerr=carroll_lear_errors,
                 capsize=1,
                 fmt='r')

    plt.xticks(range(len(consonants)), consonants)
    plt.xlabel('Consonant')
    plt.ylabel('Consonant density by syll. number')
    plt.title('Real words (black) vs. neologisms from Carroll/Lear (red)')

    plt.show()
